Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes.TagsAttributes Property
 The attributes for detail mark tags.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMarkTagsAttributes TagsAttributes { get; set; }
Public Property TagsAttributes As DetailMarkTagsAttributes
	Get
	Set
Property Value
Type: DetailMarkTagsAttributes
See Also
Reference
DetailMark.DetailMarkAttributes Class
Tekla.Structures.Drawing Namespace